In [1]:
import numpy as np
import pandas as pd

## 1. DataFrame的基本元素Series
#### Series类似于np.array[]，是DataFrame的基本组成单位

In [2]:
from pandas import Series, DataFrame

In [19]:
data = {
    'NO': [1, 2, 3],
    'Country': ['China', 'India', 'Brazil'],
    'Capital': ['Beijing', 'New Delhi', 'Brasilia'],
    'Population': ['1432732201', '1303171635', '207847528']
}

[1, 2, 3]

## Series由索引和一个数组组成，数组存放的是value

In [9]:
s1 = Series(data['Country'])
s2 = Series(data['Capital'])
s3 = Series(data['Population'])
s1.index,s1.values

(RangeIndex(start=0, stop=3, step=1),
 array(['China', 'India', 'Brazil'], dtype=object))

## DataFrame由三部分组成 df.index(索引),df.columns(标签),df.values(值)

In [10]:
df = DataFrame(data)
df.head()

   NO Country    Capital  Population
0   1   China    Beijing  1432732201
1   2   India  New Delhi  1303171635
2   3  Brazil   Brasilia   207847528

In [21]:
df = DataFrame(data)
df.head()

   NO Country    Capital  Population
1   1   China    Beijing  1432732201
2   2   India  New Delhi  1303171635
3   3  Brazil   Brasilia   207847528

In [7]:
#遍历行
for row in df.iterrows():
    print(row[0], row[1])
    break

0 Country            China
Capital          Beijing
Population    1432732201
Name: 0, dtype: object

In [8]:
#通过Series创建DataFrame，是按行来显示，需要通过转置后才能按列显示
df_new = DataFrame([s1,s2,s3], index=['Country','Capital', 'Population'])
df_new

                     0           1          2
Country          China       India     Brazil
Capital        Beijing   New Delhi   Brasilia
Population  1432732201  1303171635  207847528

In [9]:
df_new.T

  Country    Capital  Population
0   China    Beijing  1432732201
1   India  New Delhi  1303171635
2  Brazil   Brasilia   207847528

## 2. pandas 常用数据结构 DataFrame

In [10]:
import webbrowser

In [11]:
link = 'http://pandas.pydata.org/pandas-docs/version/0.20/io.html'
webbrowser.open(link)

True

### 创建一个简单的DataFrame

In [12]:
# create a dataframe
df1 = DataFrame({"城市":["北京","上海","广州"], 
                 "人口":[1000,2000,1500]}, index=['A','B','C'])
#增加一列数据
df1['GDP'] = Series([1000,2000,1500], index=['A','B','C'])
df1

   城市    人口   GDP
A  北京  1000  1000
B  上海  2000  2000
C  广州  1500  1500

### 用剪贴板中的数据来创建DataFrame

In [13]:
df1 = pd.read_clipboard()
df1

Empty DataFrame
Columns: [unstack]
Index: []

### 将DataFrame数据输出成csv文件

In [14]:
df1.to_csv('df1.csv', index=False)
df1.to_json()
df1.to_dict(orient='list')
df1.to_html('df1.html')
df1.to_excel('df1.xlsx')
#从文件中加载数据
#如果数据本身就有索引，那么可以直接用数据的索引
pd.read_csv('df1.csv',index_col=0)
pd.read_excel('df1.xlsx')

Empty DataFrame
Columns: [Unnamed: 0, unstack]
Index: []

## 3. Series和DataFrame的索引

### reindex Series

In [15]:
s1 = Series([1,2,3,4], index=['A','B','C','D'])
s1

A    1
B    2
C    3
D    4
dtype: int64

In [16]:
#如果索引对应无数据，则用10填充
s1.reindex(index=['A','B','C','D','E'], fill_value=10)

A     1
B     2
C     3
D     4
E    10
dtype: int64

In [17]:
#重新调整索引后，使用ffill函数来填充
s2 = Series(['A','B','C'], index=[1,5,10])
s2.reindex(index=range(15),method='ffill')

0     NaN
1       A
2       A
3       A
4       A
5       B
6       B
7       B
8       B
9       B
10      C
11      C
12      C
13      C
14      C
dtype: object

In [18]:
#减少索引后，其他索引将会被删除
s1.reindex(index=['A','B'])

A    1
B    2
dtype: int64

In [19]:
#删除索引也可以用drop方法
s1.drop('A')

B    2
C    3
D    4
dtype: int64

### reindex dataframe

In [20]:
df1 = DataFrame(np.random.rand(25).reshape([5,5]), index=['A','B','D','E','F'],  columns=['c1','c2','c3','c4','c5'])
df1

         c1        c2        c3        c4        c5
A  0.868285  0.826235  0.570230  0.183155  0.104948
B  0.069968  0.228284  0.850936  0.809725  0.934666
D  0.110608  0.227716  0.515787  0.199183  0.417075
E  0.699953  0.721077  0.469069  0.618949  0.440943
F  0.109593  0.498387  0.541115  0.813273  0.244975

In [21]:
#重新调整索引后，如果增加了新索引，对应行被填充为NaN
df1.reindex(index=['A','B','C','D','E','F'])

         c1        c2        c3        c4        c5
A  0.868285  0.826235  0.570230  0.183155  0.104948
B  0.069968  0.228284  0.850936  0.809725  0.934666
C       NaN       NaN       NaN       NaN       NaN
D  0.110608  0.227716  0.515787  0.199183  0.417075
E  0.699953  0.721077  0.469069  0.618949  0.440943
F  0.109593  0.498387  0.541115  0.813273  0.244975

In [22]:
#重新调整标签后，如果增加了新标签，对应列被填充为NaN
df1.reindex(columns=['c1','c2','c3','c4','c5','c6'])

         c1        c2        c3        c4        c5  c6
A  0.868285  0.826235  0.570230  0.183155  0.104948 NaN
B  0.069968  0.228284  0.850936  0.809725  0.934666 NaN
D  0.110608  0.227716  0.515787  0.199183  0.417075 NaN
E  0.699953  0.721077  0.469069  0.618949  0.440943 NaN
F  0.109593  0.498387  0.541115  0.813273  0.244975 NaN

In [23]:
#减少索引后，其他索引将会被删除
df1.reindex(index=['A','B'])

         c1        c2        c3        c4        c5
A  0.868285  0.826235  0.570230  0.183155  0.104948
B  0.069968  0.228284  0.850936  0.809725  0.934666

In [24]:
#删除索引也可以用drop方法，当axis=0时删除行，axis=1时删除列
df1.drop('c1', axis=1)

         c2        c3        c4        c5
A  0.826235  0.570230  0.183155  0.104948
B  0.228284  0.850936  0.809725  0.934666
D  0.227716  0.515787  0.199183  0.417075
E  0.721077  0.469069  0.618949  0.440943
F  0.498387  0.541115  0.813273  0.244975

## 4. 多级索引

In [25]:
morei = Series(np.random.randn(6), index=[['1','1','1','2','2','2'],['a','b','c','a','b','c']])
morei.head(6)

1  a   -0.114389
   b   -0.329110
   c   -0.186707
2  a    1.659285
   b   -0.598617
   c    0.824047
dtype: float64

In [26]:
morei.head(6)

1  a   -0.114389
   b   -0.329110
   c   -0.186707
2  a    1.659285
   b   -0.598617
   c    0.824047
dtype: float64

In [27]:
#通过多级索引过滤
morei['1']['a']

-0.11438854062009585

In [28]:
morei[:,'a']

1   -0.114389
2    1.659285
dtype: float64

### 通过Series创建的DataFrame都是按行码的，需要转置

In [29]:
df_morei = DataFrame([morei['1'],morei['2']])
df_morei.head()

          a         b         c
0 -0.114389 -0.329110 -0.186707
1  1.659285 -0.598617  0.824047

In [30]:
morei2 = df_morei.unstack()
morei2

a  0   -0.114389
   1    1.659285
b  0   -0.329110
   1   -0.598617
c  0   -0.186707
   1    0.824047
dtype: float64

### 在用pandas进行数据重排时，经常用到stack和unstack两个函数。stack的意思是堆叠，堆积，unstack即“不要堆叠”，我对两个函数是这样理解和区分的。

![](unstack.png)

In [31]:
#df_morei.T之所以需要转置，是因为用Series构造的DataFrame是基于行形式的
morei3= df_morei.T.unstack()
morei3

0  a   -0.114389
   b   -0.329110
   c   -0.186707
1  a    1.659285
   b   -0.598617
   c    0.824047
dtype: float64

In [32]:
morei3.unstack()

          a         b         c
0 -0.114389 -0.329110 -0.186707
1  1.659285 -0.598617  0.824047

### 索引和标签都是多级的

In [68]:
df_morei2 = DataFrame(np.arange(16).reshape(4,4), index=[['a','a','b','b'],[1,2,1,2]], columns=[['BJ','BJ','SH','GZ'],[8,9,8,8]])
df_morei2

     BJ      SH  GZ
      8   9   8   8
a 1   0   1   2   3
  2   4   5   6   7
b 1   8   9  10  11
  2  12  13  14  15

In [69]:
#通过多级标签过滤
df_morei2['BJ'][8]

a  1     0
   2     4
b  1     8
   2    12
Name: 8, dtype: int32

## 5. 切片（iloc、loc）

In [28]:
movies = pd.read_csv("movie_metadata.csv")
movies.head(2)

,color,director_name,num_critic_for_reviews,duration,director_facebook_likes,actor_3_facebook_likes,actor_2_name,actor_1_facebook_likes,gross,genres,...,num_user_for_reviews,language,country,content_rating,budget,title_year,actor_2_facebook_likes,imdb_score,aspect_ratio,movie_facebook_likes
0,Color,James Cameron,723.0,178.0,0.0,855.0,Joel David Moore,1000.0,760505847.0,Action|Adventure|Fantasy|Sci-Fi,...,3054.0,English,USA,PG-13,237000000.0,2009.0,936.0,7.9,1.78,33000
1,Color,Gore Verbinski,302.0,169.0,563.0,1000.0,Orlando Bloom,40000.0,309404152.0,Action|Adventure|Fantasy,...,1238.0,English,USA,PG-13,300000000.0,2007.0,5000.0,7.1,2.35,0

In [29]:
sub_movies = movies[['color','director_name','country']]
sub_movies.head(1)

   color  director_name country
0  Color  James Cameron     USA

In [30]:
sub_movies_slice = sub_movies.iloc[10:200,:3]
sub_movies_slice.head(2)

    color director_name country
10  Color   Zack Snyder     USA
11  Color  Bryan Singer     USA

In [31]:
#loc中第二个参数是标签名称，可以是标签范围
#X.loc[startRow:endRow,‘标签1’:'标签N']
sub_movies_slice.loc[5:12,'director_name':]

   director_name country
10   Zack Snyder     USA
11  Bryan Singer     USA
12  Marc Forster      UK

## 6. 索引重命名

In [90]:
df_rename = DataFrame(np.arange(9).reshape(3,3), index=['BJ','SH','GZ'], columns=['A','B','C'])
df_rename

    A  B  C
BJ  0  1  2
SH  3  4  5
GZ  6  7  8

In [91]:
df_rename.rename(index=str.lower, columns=str.lower)

    a  b  c
bj  0  1  2
sh  3  4  5
gz  6  7  8

In [93]:
#重命名具体索引或标签
df_rename.rename(index={'BJ': 'beijing'}, columns={"A":'a'})

         a  B  C
beijing  0  1  2
SH       3  4  5
GZ       6  7  8

### 通过自定义函数重命名

In [94]:
def test_map(x):
    return x + '_ABC'

df_rename.index.map(test_map)
df_rename.rename(index=test_map)

        A  B  C
BJ_ABC  0  1  2
SH_ABC  3  4  5
GZ_ABC  6  7  8

## 7. NaN（Not a Number）

In [70]:
n = np.nan
type(n)

float

In [71]:
1+n

nan

In [73]:
ns1 = Series([1, 2, np.nan, 3, 4], index=['A','B','C','D','E'])
ns1

A    1.0
B    2.0
C    NaN
D    3.0
E    4.0
dtype: float64

In [75]:
ns1.isnull()

A    False
B    False
C     True
D    False
E    False
dtype: bool

In [76]:
ns1.notnull()

A     True
B     True
C    False
D     True
E     True
dtype: bool

In [77]:
#删除掉元素为NaN的数据
ns1.dropna()

A    1.0
B    2.0
D    3.0
E    4.0
dtype: float64

### NaN in DataFrame

In [105]:
df_nan = DataFrame([[1,2,3],[np.nan,5,6],[7,np.nan,9],[np.nan,np.nan,np.nan]])
df_nan

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [79]:
df_nan.isnull()

       0      1      2
0  False  False  False
1   True  False  False
2  False   True  False
3   True   True   True

In [80]:
df_nan.notnull()

       0      1      2
0   True   True   True
1  False   True   True
2   True  False   True
3  False  False  False

In [83]:
#只要某行中包含一个NaN就删除行
#axis=0按行删除，axis=1按列删除
df_nan.dropna(axis=0,how='any')

     0    1    2
0  1.0  2.0  3.0

In [82]:
#行中数据都为NaN，才删除行
df_nan.dropna(axis=0,how='all')

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0

In [85]:
df_nan.sum(axis=0)

0     6.0
1    11.0
2    16.0
3     0.0
dtype: float64

In [86]:
#只有某行中NaN数量大于2才删除此行
df_nan.dropna(axis=0,thresh=2)

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0

In [87]:
#把所有NaN的位置都填充成0
df_nan.fillna(0)

     0    1    2
0  1.0  2.0  3.0
1  0.0  5.0  6.0
2  7.0  0.0  9.0
3  0.0  0.0  0.0

In [88]:
#第0列填充成0，第1列填充成1....
df_nan.fillna(value={0:0,1:1,2:2,3:3})

     0    1    2
0  1.0  2.0  3.0
1  0.0  5.0  6.0
2  7.0  1.0  9.0
3  0.0  1.0  2.0

In [106]:
#用平均值填充NaN，inplace=True表示要修改原始数据
df_nan[0].fillna(df_nan[0].mean(),inplace=True)

In [107]:
df_nan

     0    1    2
0  1.0  2.0  3.0
1  4.0  5.0  6.0
2  7.0  NaN  9.0
3  4.0  NaN  NaN